[
{"title": "X (2002) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/X-326430"},
{"title": "X (2021) - full transcript", "plot": "<p class=\"plot\">A brief encounter causes one man to reflect on the monumental impact that an 'ex' has had on his life...but can the man rediscover his once sentimental soul and reconnect with the notion that \"all you need is love\"?</p>", "url": "https://subslikescript.com/movie/X-13262868"},
{"title": "X (1996) - full transcript", "plot": "<p class=\"plot\">The story takes place in 1999, the Year of Destiny, and the beginning of the end of the world. The future of the universe rests on one young man, Kamui Shiro, who must destroy either the ...</p>", "url": "https://subslikescript.com/movie/X-118200"},
{"title": "X (2022) - full transcript", "plot": "<p class=\"plot\">Set in 1979, adult movie actors and a small film crew arrive to a farmhouse occupied by an elderly couple in the desolate Texas countryside to film an adult movie. As the day shifts to night, the visitors slowly realize that they are not safe, and are being targeted by a nearby enemy.</p>", "url": "https://subslikescript.com/movie/X-13560574"},
{"title": "X - The eXploited (2018) - full transcript", "plot": "<p class=\"plot\">Would you believe in a policewoman who suffers from such serious panic disorders that she is afraid to get close to any crime scene and has been on permanent office duty for more than a decade? Would you believe a lone mother who is unfit to pay her mortgage and also raise her rebellious teenage daughter? Indeed, no one believes that the troubled ex-detective has discovered a serial murder case. Personal dramas and a murder mystery unfold in present-day Budapest, where demonstrations are part of the pre-election life of a city still trying to cope with the shadows of its historical and recent past. It is a city where nothing seems honest and true, except through the eyes of an emotionally unstable policewoman and her misfit daughter who wants to know who her father truly was.</p>", "url": "https://subslikescript.com/movie/X_-_The_eXploited-6190456"},
{"title": "X Men Origins: Wolverine T4 Movie Special (2009) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/X_Men_Origins_Wolverine_T4_Movie_Special-1423570"},
{"title": "X Moor (2014) - full transcript", "plot": "<p class=\"plot\">A pair of documentarians head into the woods of the Exmoor countryside to find proof of the mysterious big cats that roam the area. But what they find in the depths of the forest is a horror beyond imagine. They must fight tooth and nail to survive or fall prey to what lurks in the darkness.</p>", "url": "https://subslikescript.com/movie/X_Moor-3293138"},
{"title": "X the Unknown (1956) - full transcript", "plot": "<p class=\"plot\">British Army radiation drills at a remote Scottish base attract a subterranean, radioactive entity of unknown nature that vanishes, leaving two severely radiation-burned soldiers... and a \"bottomless\" crack in the earth. Others who meet the thing in the night suffer likewise, and with increasing severity; it seems to be able to \"absorb\" radiation from any source, growing bigger and bigger. What is it?? How do you destroy a thing that \"feeds\" on energy?</p>", "url": "https://subslikescript.com/movie/X_the_Unknown-49967"},
{"title": "X-Deal (2011) - full transcript", "plot": "<p class=\"plot\">Photographer Billy and his girlfriend Sarah have just moved into a new apartment. They are no longer in love, but they content themselves with sex, often involving role play. Billy becomes enamored with their new neighbor Dana, who spends her days at home blogging and supplying drugs to a local dealer. The thing is, Dana's more attracted to Sarah. Billy lays out a deal: Dana can spend the night with Sarah, and in exchange, he gets to have sex with her. Billy manipulates the two ladies to get what he wants, but he fails to realize the risk of the arrangement.</p>", "url": "https://subslikescript.com/movie/X-Deal-2049597"},
{"title": "X-Men (2000) - full transcript", "plot": "<p class=\"plot\">In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him.</p>", "url": "https://subslikescript.com/movie/X-Men-120903"},
{"title": "X-Men 2 (2003) - full transcript", "plot": "<p class=\"plot\">Several months have passed since The X-Men defeated Magneto and imprisoned him in a seemingly impregnable plastic chamber. One day, a mutant by the name of Nightcrawler infiltrates the White House and attempts to assassinate the president, setting off a chain reaction of anti-mutant measures by the government. Meanwhile, Logan is trying to discover his past. As scientist named William Stryker discovers Professor X's secret school and Cerebro, Magneto's partner, Mystique, is planning to break her leader out of prison. But when Professor X's school is attacked by Stryker's forces, Logan, Rogue, Iceman and a few are lucky to escape. Those who remain meet in Boston, where they form an uneasy alliance with Magneto to stop Stryker and rescue Professor X.</p>", "url": "https://subslikescript.com/movie/X-Men_2-290334"},
{"title": "X-Men Origins: Wolverine (2009) - full transcript", "plot": "<p class=\"plot\">Two mutant brothers, Logan and Victor, born 200 years ago, suffer childhood trauma and have only each other to depend on. Basically, they're fighters and killers, living from war to war through U.S. history. In modern times, a U.S. colonel, Stryker, recruits them and other mutants as commandos. Logan quits and becomes a logger, falling in love with a local teacher. When Logan refuses to rejoin Stryker's crew, the colonel sends the murderous Victor. Logan now wants revenge.</p>", "url": "https://subslikescript.com/movie/X-Men_Origins_Wolverine-458525"},
{"title": "X-Men: Apocalypse (2016) - full transcript", "plot": "<p class=\"plot\">Since the dawn of civilization, he was worshiped as a god. Apocalypse, the first and most powerful mutant from Marvel's X-Men universe, amassed the powers of many other mutants, becoming immortal and invincible. Upon awakening after thousands of years, he is disillusioned with the world as he finds it and recruits a team of powerful mutants, including a disheartened Magneto, to cleanse mankind and create a new world order, over which he will reign. As the fate of the Earth hangs in the balance, Raven with the help of Professor X must lead a team of young X-Men to stop their greatest nemesis and save mankind from complete destruction.</p>", "url": "https://subslikescript.com/movie/X-Men_Apocalypse-3385516"},
{"title": "X-Men: Dark Phoenix (2019) - full transcript", "plot": "<p class=\"plot\">Jean Grey begins to develop incredible powers that corrupt and turn her into a Dark Phoenix, causing the X-Men to decide if her life is worth more than all of humanity.</p>", "url": "https://subslikescript.com/movie/X-Men_Dark_Phoenix-6565702"},
{"title": "X-Men: Days of Future Past (2014) - full transcript", "plot": "<p class=\"plot\">In the future, the mutants and the humans that help them are slaughtered by powerful robots named Sentinels. Professor Xavier, Wolverine, Magneto, Storm, Kitty Pryde and her friends meet at a monastery in China and Xavier explains that the invincible Sentinels were created using the DNA of Mystique that was captured in 1973 when she tried to assassinate their creator Dr. Bolivar Trask. Xavier tells that their only chance is return to 1973 using Pryde's ability to join Charles Xavier and Erik Lehnsherr to convince Mystique to give up of her intention. . However, only Wolverine can withstand the damages of the time travel. Will he succeed in stopping Mystique and the Sentinel Program and save the mutants and their human friends from annihilation?</p>", "url": "https://subslikescript.com/movie/X-Men_Days_of_Future_Past-1877832"},
{"title": "X-Men: First Class (2011) - full transcript", "plot": "<p class=\"plot\">Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were archenemies, they were closest of friends, working together, with other Mutants (some familiar, some new), to stop the greatest threat the world has ever known. In the process, a rift between them opened, which began the eternal war between Magneto's Brotherhood and Professor X's X-MEN.</p>", "url": "https://subslikescript.com/movie/X-Men_First_Class-1270798"},
{"title": "Xenia (2014) - full transcript", "plot": "<p class=\"plot\">Strangers in their own birthplace, 16-year-old Danny and 18-year-old Odysseus cross the entire country in search of their Greek father, after their Albanian mother passes away. Determined to force him to acknowledge paternity, little do they know that the road to the much-coveted Greek citizenship is paved with ghosts from the past, adult savagery and a dream that needs to come true, no matter what. Reaching the end of this initiatory journey they eventually come of age even if Greece refuses to follow.</p>", "url": "https://subslikescript.com/movie/Xenia-3186946"},
{"title": "Xena: Warrior Princess - A Friend in Need (The Director's Cut) (2002) - full transcript", "plot": "<p class=\"plot\">A director's cut version of the final two episodes of Xena: Warrior Princess.</p>", "url": "https://subslikescript.com/movie/Xena_Warrior_Princess_-_A_Friend_in_Need_The_Directors_Cut-817532"},
{"title": "XConfessions Vol. 22 (2020) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/XConfessions_Vol_22-13907180"},
{"title": "Xane: The Vampire God (2020) - full transcript", "plot": "<p class=\"plot\">Xane, an immortal vampire, returns to the past to save his former self, Titus. Xane must rescue Titus and stop him from inheriting the curse. Xane is able to save his loved ones, but the broad strokes of time cannot be altered.</p>", "url": "https://subslikescript.com/movie/Xane_The_Vampire_God-9515732"},
{"title": "Xanda (2004) - full transcript", "plot": "<p class=\"plot\">Xanda is the latest film for Tsui Hark as producer. The film concentrates on a kung fu fighter from the countryside named Qiang who goes to the big city, where he learns about the new sport that's sweeping the city. Xanda is a hybrid form of martial arts, varying mainly on kickboxing and grappling. When his friend Lung is seriously injured by the current Xanda champion Wei, Qiang learns to combine his traditional kung fu with Xanda techniques to win the championship.</p>", "url": "https://subslikescript.com/movie/Xanda-388547"},
{"title": "Xanadu (1980) - full transcript", "plot": "<p class=\"plot\">The Greek muses incarnate themselves on Earth to inspire men to achieve. One of them, incarnated as a girl named Kira, encounters an artist named Sonny Malone. With the help of Danny McGuire, a man Kira had inspired forty years earlier, Sonny builds a huge disco roller rink.</p>", "url": "https://subslikescript.com/movie/Xanadu-81777"},
{"title": "X&Y (2018) - full transcript", "plot": "<p class=\"plot\">An artist has chosen a famous male actor for them together, in the context of a feature film, to deconstruct themselves and their invading roles. They engage in a boundless play with their ...</p>", "url": "https://subslikescript.com/movie/XY-8587142"},
{"title": "X/Y (2014) - full transcript", "plot": "<p class=\"plot\">A look at the lives and interactions of a group of friends living in New York.</p>", "url": "https://subslikescript.com/movie/XY-2790182"},
{"title": "X: Yochou (2001) - full transcript", "plot": "<p class=\"plot\">Trapped alone in a world of dreams, a young man pines away for the love he has lost. His name is Kakyou Kuzuki, and in his dreams, he sees the future of our fragile planet. A great battle is approaching, a war of destiny to destroy the Earth, or to save it. Two sides, two points of view clash in apocalyptic strength, in a struggle that will tear the world apart and destroy the lives of many. Kakyou's love was the first casualty. Now, comatose and wishing only for death so he can join his beloved, he watches as the gears of fate begin to turn, and the soldiers of destiny march towards doom...</p>", "url": "https://subslikescript.com/movie/X_Yochou-492922"},
{"title": "X: The Man with the X-Ray Eyes (1963) - full transcript", "plot": "<p class=\"plot\">Dr. James Xavier is a world renowned scientist experimenting with human eyesight. He devises a drug, that when applied to the eyes, enables the user to see beyond the normal realm of our sight (ultraviolet rays etc.) it also gives the user the power to see through objects. Xavier tests this drug on himself, when his funding is cut off. As he continues to test the drug on himself, Xavier begins to see, not only through walls and clothes, but through the very fabric of reality!</p>", "url": "https://subslikescript.com/movie/X_The_Man_with_the_X-Ray_Eyes-57693"},
{"title": "X-Ray (1981) - full transcript", "plot": "<p class=\"plot\">Divorcee Susan Jeremy goes to a local Los Angeles county hospital for a routine exam and finds herself stranded there while a maniac, dressed in a doctor's surgical mask and clothing, goes around killing all the staff are associated with her. Could it possibly be the psycho Harold, who killed a friend of Susan's on Valentine's Day 19 years earlier?</p>", "url": "https://subslikescript.com/movie/X-Ray-82527"},
{"title": "X-Rated: The Greatest Adult Movies of All Time (2015) - full transcript", "plot": "<p class=\"plot\">A look at a plethora of pornographic films ranging from the 1970s to the 2010s and a commentary about their lasting impacts on the adult industry and the world.</p>", "url": "https://subslikescript.com/movie/X-Rated_The_Greatest_Adult_Movies_of_All_Time-4461838"},
{"title": "X-Men: The Last Stand (2006) - full transcript", "plot": "<p class=\"plot\">When a cure is created, which apparently can turn any mutant into a normal human being, there is outrage amongst the mutant community. Whilst some mutants do like the idea of a cure, including Rogue, many mutants find that there shouldn't be a cure. Magneto, who still believes a war is coming, recruits a large team of mutants to take down Warren Worthington II and his cure. Might seem easy for the X-Men to stop, but Magneto has a big advantage, which Wolverine doesn't have. Jean Grey has returned, and joined with Magneto. The Phoenix has woken within her, which has the ability to destroy anything in her way, even if that 'anything' is a X-Men.</p>", "url": "https://subslikescript.com/movie/X-Men_The_Last_Stand-376994"},
{"title": "X-Rated 2: The Greatest Adult Stars of All Time! (2016) - full transcript", "plot": "<p class=\"plot\">Documentary sequel that offers a close-up look into the personal lives of the legendary porn stars who've survived the test of time and influenced popular culture. Blends rare interviews ...</p>", "url": "https://subslikescript.com/movie/X-Rated_2_The_Greatest_Adult_Stars_of_All_Time-6189052"},
{"title": "Xenophobia (2019) - full transcript", "plot": "<p class=\"plot\">Six complete strangers recall the details of their individual experiences with alien forces-sharing the terrifying stories of their abductions and possessions.</p>", "url": "https://subslikescript.com/movie/Xenophobia-8571404"},
{"title": "Xi He (2015) - full transcript", "plot": "<p class=\"plot\">Xi He is a 9 year old autistic child who loves to go to school. However, his classmates' parents are afraid of his condition and don't want him to study with their children. For the fourth time, he gets expelled from his school for misbehaving. The director of the school wants to help but with his hands tied, succumbs to the pressure from the other parents. Xi He's mother fights for her son's right to a normal education despite his imperfection. She wants him to have the chance for a normal life. Back in the Chinese countryside, her brother suffers from autism and is hunted by the ignorant people from her village. Her old mother, unable to take care of him any longer, keeps him in a cage to keep him safe from others and from himself; like an animal. Tian Lin's childhood looms of memories tinted by her brother's life's effect on hers. She decides to teach Xi He herself, willing to do everything to save him from this destiny.</p>", "url": "https://subslikescript.com/movie/Xi_He-4253132"},
{"title": "XX: Beautiful Beast (1995) - full transcript", "plot": "<p class=\"plot\">Ran comes to Japan, and makes an immediate impression by assassinating a Yakuza boss and his associates, while they dine in a restaurant.</p>", "url": "https://subslikescript.com/movie/XX_Beautiful_Beast-167498"},
{"title": "XX (2007) - full transcript", "plot": "<p class=\"plot\">Recovering from a failed love affair, Shiyori and best friend Aiko head to the country. But they soon discover that the tranquil village is the home of a cult with a fetish for cutting off female legs. They try to escape but are split up and keep in touch via mobile phone. But will they meet a grisly end?</p>", "url": "https://subslikescript.com/movie/XX-1043877"},
{"title": "Xtro 3: Watch the Skies (1995) - full transcript", "plot": "<p class=\"plot\">Marines travel to a deserted island to diffuse bombs, only to be terrorized by a deadly alien creature.</p>", "url": "https://subslikescript.com/movie/Xtro_3_Watch_the_Skies-115006"},
{"title": "Xtro (1982) - full transcript", "plot": "<p class=\"plot\">Tony's father Sam, abducted by aliens three years earlier, returns to earth and seeks out his wife and son, but Rachel has since been living with Joe and the reunion is awkward. Joe doesn't trust Sam, and Rachel can't quite decide what her feelings are for her two men. Sam is not the same as when he left, and he begins affecting Tony in frightening ways.</p>", "url": "https://subslikescript.com/movie/Xtro-86610"},
{"title": "Xterminator and the AI Apocalypse (2023) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xterminator_and_the_AI_Apocalypse-27589686"},
{"title": "XTC: This Is Pop (2017) - full transcript", "plot": "<p class=\"plot\">A brand new film on one of Britain's best-loved and most influential bands of modern times, XTC. Emerging from the late 1970s punk and new wave explosion, XTC amassed a devoted following ...</p>", "url": "https://subslikescript.com/movie/XTC_This_Is_Pop-7465694"},
{"title": "XOXO (2016) - full transcript", "plot": "<p class=\"plot\">Six strangers' lives collide in one frenetic, dream-chasing, hopelessly romantic night.</p>", "url": "https://subslikescript.com/movie/XOXO-4855748"},
{"title": "Xolo (2017) - full transcript", "plot": "<p class=\"plot\">South of Italy. Rosa is a woman with a troubled past. Gino, Rosa's lover, is a violent landowner engaged in dogfights. When Rosa meets Nathaniel, a french drifter, her life takes a new, unexpected turn.</p>", "url": "https://subslikescript.com/movie/Xolo-9676614"},
{"title": "XL: The Temptation of Christ (2018) - full transcript", "plot": "<p class=\"plot\">The Temptation of Christ is detailed in the Gospels of Matthew, Mark and Luke. According to these texts, after being baptized by John the Baptist, Jesus fasted for forty days and forty ...</p>", "url": "https://subslikescript.com/movie/XL_The_Temptation_of_Christ-7697348"},
{"title": "XL (2013) - full transcript", "plot": "<p class=\"plot\">Leifur Sigurdarson, an unstoppable ladies man and alcoholic parliament member, is forced in rehab by his friend and boss, the Prime Minister of Iceland. But before he gets spanked in public, he invites his friends over for a gargantuan feast. During the party we get to know Leifur and the other characters in the movie as well as finding out about Leifur's, and his posse's, sordid past.</p>", "url": "https://subslikescript.com/movie/XL-2359473"},
{"title": "Xingu (2011) - full transcript", "plot": "<p class=\"plot\">In the '40s, three brothers decide to live a great adventure and enlisting in the Roncador-Xingu Expedition, which has a mission to tame the Central Brazil. The Villas Boas brothers: Orlando, 27, Claudius, 25, and Leonardo, 23, engage in a fantastic and incredible saga. Soon start to lead the expedition that opens new paths 1,500 km, navigates over 1,000 miles of unspoilt rivers, opens 19 airfields for airplanes Army, gives rise to the creation of 43 towns and 14 make contact with wild Indian tribes, unknown, as the Xavante, courageous and feared warriors, no casualties on both sides. This adventure allows the Villas Boas brothers the creation of the Xingu National Park, the first major Amerindian reservation in Brazil, the size of Belgium, transforming them into true contemporary heroes .</p>", "url": "https://subslikescript.com/movie/Xingu-2142055"},
{"title": "Xing yuan (1999) - full transcript", "plot": "<p class=\"plot\">A young man, blind and dumb, works as an audio tape typist in a hospital and fostering a tender and sincere relationship with a beautiful but introverted nurse. When hit by a car, he is the sixty billionth human being to die on earth, and is on transit to Polaris, en route to a yet more sophisticated form of existence in Vega. Given a reprieve of five days and a chance to be reunited with his love on earth, he cannot reveal his true identity behind the temporary facade he must present to her. Both boy and girl eventually learn, through a tangle of difficult and miraculous events, how love and good things always find ways of creeping into people's lives when people are not greedy and least expect these blessings.</p>", "url": "https://subslikescript.com/movie/Xing_yuan-213314"},
{"title": "Xin ti xiao yin yuan (1975) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xin_ti_xiao_yin_yuan-73314"},
{"title": "Xin qing guó qingchéng (2005) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xin_qing_gu_qingchng-4020122"},
{"title": "Xin Qiji 1162 (2020) - full transcript", "plot": "<p class=\"plot\">In 1161, Wanyan Liang, emperor of the Jurchen Jin Dynasty, planned to invade the Southern Song Dynasty. Owing to the harsh recruitment policy and the Jin's cruelty, people in the Central ...</p>", "url": "https://subslikescript.com/movie/Xin_Qiji_1162-12764298"},
{"title": "Xin chen san wu niang (1967) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xin_chen_san_wu_niang-62505"},
{"title": "XY Chelsea (2019) - full transcript", "plot": "<p class=\"plot\">A look at the life and career of Chelsea Manning, a trans woman soldier in the United States Army, who was sentenced to serve 35 years at an all-male military prison for leaking information about the country's wars in Iraq and Afghanistan.</p>", "url": "https://subslikescript.com/movie/XY_Chelsea-6905676"},
{"title": "XXXHOLic: Shunmuki - Zenpen (2009) - full transcript", "plot": "<p class=\"plot\">Watanuki and Domeki enjoy meal and drinks with the fortune teller, where Kohane is staying. There, it's explained that everyone changes with every meeting they experience with others, and that all four there, and even Yuko, have changed from meeting Watanuki. Later on, Haruka and Watanuki meet in a dream, in which Haruka asks Watanuki to look for something in the temple's storeroom. However, as they look around, they seemed to have stepped into the realm within the book by accident.</p>", "url": "https://subslikescript.com/movie/XXXHOLic_Shunmuki_-_Zenpen-1263772"},
{"title": "XXXHOLiC: Shunmuki - Kouhen (2009) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/XXXHOLiC_Shunmuki_-_Kouhen-1461305"},
{"title": "XxxHolic (2022) - full transcript", "plot": "<p class=\"plot\">Watanuki has a special ability to see ayakashi. One day, he is led by a butterfly to a mysterious store. There, he meets the owner of the store Yuuko. She tells him that she will grant him a wish for his most precious thing.</p>", "url": "https://subslikescript.com/movie/XxxHolic-16233104"},
{"title": "xXx: State of the Union (2005) - full transcript", "plot": "<p class=\"plot\">Darius Stone, a new agent in the xXx program, is sent to Washington, D.C. to stop a coup attempt against the President of the United States.</p>", "url": "https://subslikescript.com/movie/xXx_State_of_the_Union-329774"},
{"title": "xXx: Return of Xander Cage (2017) - full transcript", "plot": "<p class=\"plot\">Extreme athlete turned government operative Xander Cage (Vin Diesel) comes out of self-imposed exile, thought to be long dead, and is set on a collision course with deadly alpha warrior Xiang (Donnie Yen) and his team in a race to recover a sinister and seemingly unstoppable weapon known as Pandora's Box. Recruiting an all-new group of thrill-seeking cohorts, Xander finds himself enmeshed in a deadly conspiracy that points to collusion at the highest levels of world governments.</p>", "url": "https://subslikescript.com/movie/xXx_Return_of_Xander_Cage-1293847"},
{"title": "xXx (2002) - full transcript", "plot": "<p class=\"plot\">Xander \"XXX\" Cage is a thrill seeker who until now has been deemed untouchable by the law. NSA Agent Gibbons forces XXX to cooperate with the government to infiltrate an underground Russian crime ring, and avoid going to prison. Gibbons sends XXX to enter this world of crime undetected where others have failed, using his natural athletic prowess and a whole lot of attitude. Xander must combat an organization led by a clever, ruthless and nihilistic Yorgi whose first target is the city of Prague.</p>", "url": "https://subslikescript.com/movie/xXx-295701"},
{"title": "XIII: The Conspiracy (2008) - full transcript", "plot": "<p class=\"plot\">The first female US President Sally Sheridan is shot dead by a sniper during her Veterans Day speech. Her assassin narrowly escapes the scene with his life, national security hot on his heels - or so it seems. Three months later, an elderly couple discover the body of a wounded man in a tree, wearing a parachute. The young man (Dorff) cannot remember the slightest thing about his own identity. The only clue is a tattoo on his neck, \"XIII\". Meanwhile, in the Whitehouse, government intelligence is still conducting the search for the President's killer. With the elections just weeks away, a confirmed suspect could swing the vote for the administration. Hours after XIII's location is picked up by covert intelligence, elite special ops forces are swarming the couple's house in Cape Fear. Running on adrenaline and instinct, XIII tactically takes out the soldiers one by one. On the run, clinging to one desperate clue after another, XIII begins to piece back his life, fragments of his memory returning. Finally captured, he learns that he has been given a stolen identity and placed undercover to flush out a group of conspirators threatening to overthrow the government. Ensconced within the highest echelons of power the conspirators run their own security agency alongside the Government's. Both are out to find him. The only way for XIII to get his own life back is to play bait. A dangerous game, especially when you don't know who you really are.</p>", "url": "https://subslikescript.com/movie/XIII_The_Conspiracy-1117667"},
{"title": "Xie zi (1992) - full transcript", "plot": "<p class=\"plot\">A group of police friends are investigating a suspicious fellow officer who might be involved in drugs and prostitution.</p>", "url": "https://subslikescript.com/movie/Xie_zi-2183186"},
{"title": "Xico's Journey (2020) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xicos_Journey-12481806"},
{"title": "Xiao zi ming da (1979) - full transcript", "plot": "<p class=\"plot\">While on a fishing trip, Shao Lung's father is killed by Wu Pa Feng in front of the young man's eyes. Lung takes shelter with his uncle's traveling group of Kung Fu acrobats and begins honing his skills so he can one day have his revenge.</p>", "url": "https://subslikescript.com/movie/Xiao_zi_ming_da-79142"},
{"title": "Xiao Wu (1998) - full transcript", "plot": "<p class=\"plot\">Little pocket thief Wu never got away from the streets like his friends did. He realises that he is alone, as his old buddy doesn't invite him for his wedding. When he falls in love with a hooker he is forced to think about his future. Can he break with his criminal past?</p>", "url": "https://subslikescript.com/movie/Xiao_Wu-144020"},
{"title": "Xiao lan (2022) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xiao_lan-21881700"},
{"title": "Xiao hun yu (1979) - full transcript", "plot": "<p class=\"plot\">Three inmates in an asylum tell their stories. Story 1, a husband and wife discover they should be careful what they wish for. Story 2, a naked female ghost gets revenge from her watery grave. Story 3, a dead prostitute returns as a ghost.</p>", "url": "https://subslikescript.com/movie/Xiao_hun_yu-79801"},
{"title": "Xiao hai (2009) - full transcript", "plot": "<p class=\"plot\">One of Tsai's last and most successful television films, Boys also marks Lee Kang-sheng's acting debut. A slice-of-life tale of a teenager whose attempts to blackmail a younger student goes strangely awry, Boys is a key transition...</p>", "url": "https://subslikescript.com/movie/Xiao_hai-290939"},
{"title": "Xiang Gang qi an 5: Jian mo (1977) - full transcript", "plot": "", "url": "https://subslikescript.com/movie/Xiang_Gang_qi_an_5_Jian_mo-934437"},
{"title": "Xian dai hao fang nu (1985) - full transcript", "plot": "<p class=\"plot\">A wealthy businessman gives his wife everything she wants, besides one thing, a passionate sex life. The sexually frustrated woman soon gets into several other relationships and soon also learns why her husband is so uninterested with her in bed.</p>", "url": "https://subslikescript.com/movie/Xian_dai_hao_fang_nu-90224"},
{"title": "Xia ri le you you (2011) - full transcript", "plot": "<p class=\"plot\">(Mandarin with English subtitles) A paralegal (Angelababy) is sent on a undercover mission to inspect You Lele (Eddie Peng), the young owner of a stunning beach resort suspected of illegal business practices. Though the two hit if off on a very wrong note, they grow fond of each other's company despite their clashing personalities.</p>", "url": "https://subslikescript.com/movie/Xia_ri_le_you_you-2062580"},
{"title": "Xi lu xiang (1950) - full transcript", "plot": "<p class=\"plot\">Bruce Lee shined in his first leading role as A-Chang in this vivacious social comedy, playing a 10-year-old orphan who's raised by a righteous uncle (Yee), groomed by a skilled thief (Fung) and involved in all sorts of trouble around the factory of a hilariously forgetful miser (Lee Hoi-chuen, Lee's father).</p>", "url": "https://subslikescript.com/movie/Xi_lu_xiang-193633"}
]